app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path, headers: true) do |lead|
      song = Song.create(title: lead[0])
      song.artist = Artist.create(name: lead[1])
---
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2016-02-07 22:39:04.964280"], ["updated_at", "2016-02-07 22:39:04.964280"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2016-02-07 22:39:04.957665"], ["updated_at", "2016-02-07 22:39:04.957665"]]